bdcabreran/STM32-LED-Animation-PWM/Core/Src/led_animation.c
    void* pwmConfig = this->controller->PwmConfig;

    // Check for null pointers to ensure safety before accessing them
    if (this == NULL || this->controller == NULL || pwmConfig == NULL || colorValues == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    // Ensure that the colorCount does not exceed predefined limits (if applicable)
    if (colorCount > MAX_COLOR_CHANNELS)
    {
        return LED_ERROR_INVALID_ARGUMENT;
    }

    LED_Animation_SetCurrentColor(this, colorValues, colorCount);

    for (uint32_t i = 0; i < colorCount; i++)
    {
        // Checks to ensure colorValues[i] is within the expected range if needed
        if (colorValues[i] > LED_MAX_BRIGHTNESS)
        {
            return LED_ERROR_INVALID_VALUE;
        }

        uint32_t dutyCycle = BRIGHTNESS_TO_DUTY_CYCLE(colorValues[i], this->controller->MaxDutyCycle);

        // check if Function exists in the PWM_Channel_t structure
        if (((PWM_Channel_t*)pwmConfig)[i].setDutyCycle == NULL)
        {
            return LED_ERROR_NULL_POINTER;
        }

        ((PWM_Channel_t*)pwmConfig)[i].setDutyCycle(dutyCycle);
    }

    return LED_SUCCESS;
}

/**
 * @brief Directly sets duty cycles for PWM outputs based on provided duty cycle
 * values.
 *
 * This function provides a direct method to control the brightness of LEDs by
 * directly setting the PWM duty cycles. It is intended for scenarios where
 * precise control over the light output is necessary or where duty cycles are
 * pre-calculated.
 *
 * @param this Pointer to the LED handle containing controller information.
 * @param DutyCycleValues Array of uint16_t representing duty cycle values that
 * directly set the PWM output.
 * @param DutyCycleCount Number of elements in the DutyCycleValues array.
 *
 * @note This function is particularly useful in applications requiring precise
 * control over LED brightness or complex animations, where the duty cycle needs
 * specific adjustment or is determined by system logic, rather than
 * straightforward color brightness input.
 */
static LED_Status_t SetDutyCycleGeneric(LED_Handle_t* this, uint16_t* DutyCycleValues, uint32_t DutyCycleCount)
{

    void* pwmConfig = this->controller->PwmConfig;

    // Check for null pointers to ensure safety before accessing them
    if (this == NULL || this->controller == NULL || pwmConfig == NULL || DutyCycleValues == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    // Ensure that the DutyCycleCount does not exceed predefined limits (if applicable)
    if (DutyCycleCount > MAX_COLOR_CHANNELS)
    {
        return LED_ERROR_INVALID_ARGUMENT;
    }

    // LED_Animation_SetCurrentColorFromDutyCycle(this, DutyCycleValues, DutyCycleCount);

    for (uint32_t i = 0; i < DutyCycleCount; i++)
    {
        // checks to ensure DutyCycleValues[i] is within the expected range if needed
        if (DutyCycleValues[i] > this->controller->MaxDutyCycle)
        {
            return LED_ERROR_INVALID_VALUE;
        }
        uint32_t dutyCycle = DutyCycleValues[i];

        // check if Function exists in the PWM_Channel_t structure
        if (((PWM_Channel_t*)pwmConfig)[i].setDutyCycle == NULL)
        {
            return LED_ERROR_NULL_POINTER;
        }

        ((PWM_Channel_t*)pwmConfig)[i].setDutyCycle(dutyCycle);
    }

    return LED_SUCCESS;
}

/**
 * @brief
 *
 * @param this
 * @param colorValues
 * @return LED_Status_t
 */
/**
 * @brief Executes the color setting for the LED.
 *
 * This function sets the color values for the LED based on the provided color values array.
 * It calculates the number of color channels based on the LED type and sets the color values
 * using a generic function. If an error occurs during the color setting, it stops the animation
 * and calls the callback function with the animation type and the error status.
 *
 * @param this Pointer to the LED handle structure.
 * @param colorValues Pointer to the array of color values.
 * @return LED_Status_t The status of the color setting operation.
 *         - LED_SUCCESS: Color setting was successful.
 *         - LED_ERROR_NULL_POINTER: Null pointer was passed as an argument.
 */
static LED_Status_t ExecuteColorSetting(LED_Handle_t* this, uint8_t* colorValues)
{
    if (this == NULL || colorValues == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    LED_Status_t result = LED_SUCCESS;

    // Calculate the number of color channels based on LED type
    uint32_t colorCount = CalculateColorCount(this->controller->LedType);

    // Set the color values directly using a generic function
    result = SetColorGeneric(this, colorValues, colorCount);

    if (result != LED_SUCCESS)
    {
        // Stop the animation if an error occurred
        if (this->callback != NULL)
        {
            this->callback(this->animationType, result);
        }
        this->animationType = LED_ANIMATION_NONE;
    }

    return result;
}

/**
 * @brief Executes the duty cycle setting for the LED animation.
 *
 * This function sets the duty cycle values for the LED animation based on the provided
 * dutyCycleValues array. It calculates the number of color channels based on the LED type and sets
 * the color values using a generic function. If an error occurs during the setting of duty cycle
 * values, it stops the animation and calls the registered callback function.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @param dutyCycleValues Pointer to the array of duty cycle values.
 * @return LED_Status_t The status of the execution. Returns LED_SUCCESS if successful, or an error
 * code if an error occurred.
 */
static LED_Status_t ExecuteDutyCycleSetting(LED_Handle_t* this, uint16_t* dutyCycleValues)
{
    if (this == NULL || dutyCycleValues == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    LED_Status_t result = LED_SUCCESS;

    // Calculate the number of color channels based on LED type
    uint32_t colorCount = CalculateColorCount(this->controller->LedType);

    // Set the color values directly using a generic function
    result = SetDutyCycleGeneric(this, dutyCycleValues, colorCount);

    if (result != LED_SUCCESS)
    {
        // Stop the animation if an error occurred
        if (this->callback != NULL)
        {
            this->callback(this->animationType, result);
        }
        this->animationType = LED_ANIMATION_NONE;
    }

    return result;
}

/**
 * @brief Handles the repeat logic for the LED animation.
 *
 * This function decrements the repeat times for the LED animation and checks if the animation has
 * completed. If the repeat times reach zero, the function stops the animation and calls the
 * registered callback function.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @param PatternRepeatTimes The number of times the pattern should repeat. If set to -1, the
 * pattern repeats indefinitely.
 * @param StopOnCompletion Flag to indicate if the animation should stop when it completes.
 * @return LED_Status_t The status of the operation. Returns LED_SUCCESS if successful, or
 * LED_ANIMATION_COMPLETED if the animation has completed.
 */
static LED_Status_t HandleRepeatLogic(LED_Handle_t* this, int32_t PatternRepeatTimes, bool StopOnCompletion)
{
    if (PatternRepeatTimes != -1)
    {
        this->repeatTimes--;
        LED_CONTROL_DBG_MSG("Repeat Times: %d\r\n", this->repeatTimes);
    }
    if (this->repeatTimes == 0)
    {
        this->isRunning = false;
        if (this->callback != NULL)
        {
            this->callback(this->animationType, LED_SUCCESS);
        }

