bdcabreran/STM32-LED-Animation-PWM/Core/Src/led_animation.c
        if (StopOnCompletion)
        {
            this->controller->Stop();
        }

        return LED_ANIMATION_COMPLETED;
    }
    return LED_SUCCESS;
}

/**
 * @brief Validates the LED controller structure for the animation.
 *
 * This function checks the LED controller structure for the animation to ensure that all required
 * function pointers are not NULL. It also validates the LED type to ensure that it is a valid LED
 * type.
 *
 * @param Controller Pointer to the LED_Controller_t structure to validate.
 * @return LED_Status_t The status of the validation. Returns LED_SUCCESS if successful, or an error
 * code if an error occurred.
 */
LED_Status_t LED_AnimationValidateController(LED_Controller_t* Controller)
{
    if (Controller == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }
    if (Controller->Start == NULL || Controller->Stop == NULL || Controller->PwmConfig == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }
    if (!IS_VALID_LED_TYPE(Controller->LedType))
    {
        return LED_ERROR_INVALID_LED_TYPE;
    }
    return LED_SUCCESS;
}

/**
 * @brief Initializes the LED animation structure.
 *
 * This function initializes the LED animation structure with the provided LED controller and
 * callback function. It sets the animation type to LED_ANIMATION_NONE and the animation data to
 * NULL.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @param Controller Pointer to the LED_Controller_t structure representing the LED controller.
 * @param callback Callback function to call when the animation completes.
 * @return LED_Status_t The status of the initialization. Returns LED_SUCCESS if successful, or an
 * error code if an error occurred.
 */
LED_Status_t
LED_Animation_Init(LED_Handle_t* this, LED_Controller_t* Controller, LED_Animation_Complete_Callback callback)
{
    if (this == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    LED_Status_t status = LED_AnimationValidateController(Controller);
    if (status != LED_SUCCESS)
    {
        return status;
    }

    this->controller    = Controller;
    this->animationType = LED_ANIMATION_NONE;
    this->animationData = NULL;
    this->isRunning     = false;
    this->startTime     = 0;
    this->callback      = callback;

#if USE_LED_ANIMATION_SINE_APPROX
    update_exp_multiplier_factor();
#endif
    LED_CONTROL_DBG_MSG("LED Animation Initialized, LED type = %d\r\n", this->controller->LedType);

    return LED_SUCCESS;
}

/**
 * @brief Starts the LED animation.
 *
 * This function starts the LED animation by setting the isRunning flag to true and the start time
 * to 0.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @return LED_Status_t The status of the operation. Returns LED_SUCCESS if successful, or an error
 * code if an error occurred.
 */
LED_Status_t LED_Animation_Start(LED_Handle_t* this)
{
    LED_Status_t status = LED_SUCCESS;

    if (this == NULL)
    {
        status = LED_ERROR_NULL_POINTER;
    }

    this->isRunning = true;
    this->startTime = 0;
    LED_CONTROL_DBG_MSG("LED Animation Started\r\n");

    return status;
}

/**
 * @brief Stops the LED animation.
 *
 * This function stops the LED animation by setting the isRunning flag to false.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @return LED_Status_t The status of the operation. Returns LED_SUCCESS if successful, or an error
 * code if an error occurred.
 */
LED_Status_t LED_Animation_Stop(LED_Handle_t* this)
{
    LED_Status_t status = LED_SUCCESS;

    if (this == NULL)
    {
        status = LED_ERROR_NULL_POINTER;
    }

    this->isRunning = false;
    LED_CONTROL_DBG_MSG("LED Animation Stopped\r\n");

    return status;
}

/**
 * @brief Updates the LED animation based on the current tick value.
 *
 * This function updates the LED animation based on the current tick value. It executes the
 * animation based on the animation type and the provided animation data. If an error occurs during
 * the animation execution, it stops the animation and calls the registered callback function.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @param tick The current tick value for the animation in ms.
 * @return LED_Status_t The status of the operation. Returns LED_SUCCESS if successful, or an error
 * code if an error occurred.
 */
LED_Status_t LED_Animation_Update(LED_Handle_t* this, uint32_t tick)
{
    LED_Status_t status = LED_SUCCESS;

    // update only if tick has changed since last update call
    if (this->lastTick == tick)
    {
        return LED_SUCCESS;
    }

    if (this == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    if (IS_VALID_LED_ANIMATION_TYPE(this->animationType) == false)
    {
        return LED_ERROR_INVALID_ANIMATION_TYPE;
    }

    switch (this->animationType)
    {
    case LED_ANIMATION_NONE:
        status = LED_AnimationNoneExecute(this);
        break;
    case LED_ANIMATION_OFF:
        status = LED_AnimationOffExecute(this);
        break;
    case LED_ANIMATION_SOLID:
        status = LED_AnimationSolidExecute(this, tick);
        break;
    case LED_ANIMATION_FLASH:
        status = LED_AnimationFlashExecute(this, tick);
        break;
    case LED_ANIMATION_BLINK:
        status = LED_AnimationBlinkExecute(this, tick);
        break;
    case LED_ANIMATION_BREATH:
        status = LED_AnimationBreathExecute(this, tick);
        break;
    case LED_ANIMATION_FADE_IN:
        status = LED_AnimationFadeInExecute(this, tick);
        break;
    case LED_ANIMATION_FADE_OUT:
        status = LED_AnimationFadeOutExecute(this, tick);
        break;
    case LED_ANIMATION_PULSE:
        status = LED_AnimationPulseExecute(this, tick);
        break;
    case LED_ANIMATION_ALTERNATING_COLORS:
        status = LED_AnimationAlternatingColorsExecute(this, tick);
        break;
    case LED_ANIMATION_COLOR_CYCLE:
        status = LED_AnimationColorCycleExecute(this, tick);
        break;
    default:
        break;
    }

    this->lastTick = tick;
    return status;
}

/**
 * @brief Executes the LED animation for the LED_ANIMATION_NONE type.
 *
 * This function executes the LED animation for the LED_ANIMATION_NONE type, which is a no-op
 * function.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @return LED_Status_t The status of the operation. Returns LED_SUCCESS if successful, or an error
 * code if an error occurred.
 */
static LED_Status_t LED_AnimationNoneExecute(LED_Handle_t* this)
{
    return LED_SUCCESS;
}

/**
 * @brief Sets the LED animation to the off state.
 *
 * This function sets the LED animation to the off state by setting the animation type to
 * LED_ANIMATION_OFF and the animation data to NULL.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @return LED_Status_t The status of the operation. Returns LED_SUCCESS if successful, or an error
 * code if an error occurred.
 */
LED_Status_t LED_Animation_SetOff(LED_Handle_t* this)
{

    if (this == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_OFF;
    this->animationData = NULL;
    this->isRunning     = false;
    LED_CONTROL_DBG_MSG("LED Animation Off\r\n");

    return LED_SUCCESS;
}

static LED_Status_t LED_AnimationOffExecute(LED_Handle_t* this)
{
    if (this == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

