bdcabreran/STM32-LED-Animation-PWM/Core/Src/led_animation.c
    if (this->isRunning == false)
    {
        return LED_SUCCESS;
    }

    this->controller->Stop();
    this->isRunning = false;

    if (this->callback != NULL)
    {
        this->callback(this->animationType, LED_SUCCESS);
        this->animationType = LED_ANIMATION_NONE;
    }

    return LED_SUCCESS;
}

/**
 * @brief Sets the LED animation to the solid state.
 *
 * This function sets the LED animation to the solid state by setting the animation type to
 * LED_ANIMATION_SOLID and the animation data to the provided Solid color.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @param Solid Pointer to the LED_Animation_Solid_t structure representing the solid color
 * animation.
 * @return LED_Status_t The status of the operation. Returns LED_SUCCESS if successful, or an error
 * code if an error occurred.
 */
LED_Status_t LED_Animation_SetSolid(LED_Handle_t* this, LED_Animation_Solid_t* Solid)
{
    if (this == NULL || Solid == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_SOLID;
    this->animationData = Solid;
    this->isRunning     = false;
    LED_CONTROL_DBG_MSG("LED Animation Solid\r\n");

    return LED_SUCCESS;
}

static LED_Status_t LED_AnimationSolidExecute(LED_Handle_t* this, uint32_t tick)
{
    if (this == NULL || this->animationData == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    LED_Animation_Solid_t* Solid = (LED_Animation_Solid_t*)this->animationData;
    if (this->isRunning == false)
    {
        return LED_SUCCESS;
    }

    if (this->startTime == 0)
    {
        this->startTime = tick;
        this->controller->Start();

        // Execute color only once
        LED_Status_t result = ExecuteColorSetting(this, (uint8_t*)Solid->color);

        if (result != LED_SUCCESS)
        {
            return result;
        }
    }

    // Check if the execution time has elapsed
    uint32_t elapsedTime = tick - this->startTime;
    if (Solid->executionTimeMs > 0 && elapsedTime >= Solid->executionTimeMs)
    {
        this->isRunning = false;
        this->controller->Stop();

        if (this->callback != NULL)
        {
            this->callback(this->animationType, LED_SUCCESS);
        }
    }

    return LED_SUCCESS;
}

/**
 * @brief Sets the LED animation to the flash state.
 *
 * This function sets the LED animation to the flash state by setting the animation type to
 * LED_ANIMATION_FLASH and the animation data to the provided Flash color.
 *
 * @param this Pointer to the LED_Handle_t structure representing the LED.
 * @param Flash Pointer to the LED_Animation_Flash_t structure representing the flash color
 * animation.
 * @return LED_Status_t The status of the operation. Returns LED_SUCCESS if successful, or an error
 * code if an error occurred.
 */
LED_Status_t LED_Animation_SetFlash(LED_Handle_t* this, LED_Animation_Flash_t* Flash)
{
    if (this == NULL || Flash == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_FLASH;
    this->animationData = Flash;
    this->isRunning     = false;
    this->repeatTimes   = Flash->repeatTimes;
    LED_CONTROL_DBG_MSG("LED Animation Flash\r\n");

    return LED_SUCCESS;
}

static LED_Status_t LED_AnimationFlashExecute(LED_Handle_t* this, uint32_t tick)
{
    if (this == NULL || this->animationData == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    LED_Animation_Flash_t* Flash = (LED_Animation_Flash_t*)this->animationData;
    if (this->isRunning == false)
    {
        return LED_SUCCESS;
    }

    if (this->startTime == 0)
    {
        this->startTime   = tick; // set initial start time
        this->repeatTimes = Flash->repeatTimes;

        // Execute color only once
        LED_Status_t result = ExecuteColorSetting(this, (uint8_t*)Flash->color);
        if (result != LED_SUCCESS)
        {
            return result;
        }
    }

    uint32_t elapsedTime   = tick - this->startTime;
    uint16_t totalPeriodMs = Flash->onTimeMs + Flash->offTimeMs;

    // Determine the action based on the elapsed time within the current period
    if (elapsedTime < Flash->onTimeMs)
    {
        this->controller->Start(); // LED on during the 'on' time
    }
    else if (elapsedTime < totalPeriodMs)
    {
        this->controller->Stop(); // LED off during the 'off' time
    }

    // Reset for the next cycle or handle the completion
    if (elapsedTime >= totalPeriodMs)
    {
        this->startTime = tick; // Reset the start time for the next cycle
        HandleRepeatLogic(this, Flash->repeatTimes, false);
    }

    return LED_SUCCESS;
}

LED_Status_t LED_Animation_SetBlink(LED_Handle_t* this, LED_Animation_Blink_t* Blink)
{
    if (this == NULL || Blink == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_BLINK;
    this->animationData = Blink;
    this->isRunning     = false;
    this->repeatTimes   = Blink->repeatTimes;
    LED_CONTROL_DBG_MSG("LED Animation Blink\r\n");

    return LED_SUCCESS;
}

static LED_Status_t LED_AnimationBlinkExecute(LED_Handle_t* this, uint32_t tick)
{
    if (this == NULL || this->animationData == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    LED_Animation_Blink_t* Blink = (LED_Animation_Blink_t*)this->animationData;
    if (this->isRunning == false)
    {
        return LED_SUCCESS;
    }

    if (this->startTime == 0)
    {
        this->startTime   = tick; // set initial start time
        this->repeatTimes = Blink->repeatTimes;

        // Execute color only once
        LED_Status_t result = ExecuteColorSetting(this, (uint8_t*)Blink->color);
        if (result != LED_SUCCESS)
        {
            return result;
        }
    }

    uint32_t elapsedTime = tick - this->startTime;

    // Determine if we should turn the LED on or off
    if (elapsedTime >= Blink->periodMs)
    {
        this->startTime = tick;
        HandleRepeatLogic(this, Blink->repeatTimes, false);
    }
    else if (elapsedTime >= Blink->periodMs / 2)
    {
        // Turn LED off after half the period
        this->controller->Stop();
    }
    else
    {
        // Turn LED on for the first half of the period
        this->controller->Start();
    }

    return LED_SUCCESS;
}

LED_Status_t LED_Animation_SetBreath(LED_Handle_t* this, LED_Animation_Breath_t* Breath)
{
    if (this == NULL || Breath == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_BREATH;
    this->animationData = Breath;
    this->isRunning     = false;
    LED_CONTROL_DBG_MSG("LED Animation Breath\r\n");

    return LED_SUCCESS;
}

