bdcabreran/STM32-LED-Animation-PWM/Core/Src/led_animation.c
#if USE_LED_ANIMATION_QUADRATIC
// Computes the brightness for LED animations based on a quadratic curve.
// This function is designed for both fading in and fading out effects.
//
// Parameters:
//   elapsed      - The current time elapsed since the beginning of the animation.
//   duration     - The total duration of the LED animation.
//   maxDutyCycle - The maximum brightness level (duty cycle) for the LED.
//   isFadingIn   - A boolean flag indicating whether the LED is fading in or out.
//
// Returns:
//   The computed brightness level based on a quadratic curve.
static uint32_t GetFadeBrightnessQuadratic(uint32_t elapsed, uint32_t duration, uint32_t maxDutyCycle, bool isFadingIn)
{
    // Normalize time to a range from 0 to maxDutyCycle for direct scaling
    uint32_t normalizedTime = (elapsed * maxDutyCycle) / duration;
    uint32_t expBrightness;

    if (isFadingIn)
    {
        // Calculate brightness for fading in using a quadratic approximation:
        // Brightness = (NormalizedTime / MaxDutyCycle) ^ 2
        // Simplified here by avoiding division for optimization
        expBrightness = (normalizedTime * normalizedTime) / maxDutyCycle;
    }
    else
    {
        // Calculate brightness for fading out using the inverse of the quadratic approximation:
        // Brightness = (1 - NormalizedTime / MaxDutyCycle) ^ 2
        // Simplified here by computing the inverse time first and then squaring it
        uint32_t inverseTime = maxDutyCycle - normalizedTime;
        expBrightness        = (inverseTime * inverseTime) / maxDutyCycle;
    }

    return expBrightness;
}

#endif

#if USE_LED_ANIMATION_EXPONENTIAL
#include <math.h> // Required for exp() function
// Computes the brightness for LED animations based on an exponential curve.
// This function supports both exponential growth and decay for fading in and out.
//
// Parameters:
//   elapsed      - The current time elapsed since the beginning of the animation.
//   duration     - The total duration of the LED animation.
//   maxDutyCycle - The maximum brightness level for the LED.
//   isFadingIn   - A boolean indicating whether the LED is fading in or out.
//
// Returns:
//   The computed brightness level based on an exponential curve.
static uint32_t
GetFadeBrightnessExponential(uint32_t elapsed, uint32_t duration, uint32_t maxDutyCycle, bool isFadingIn)
{
    // Normalize progress from 0.0 to 1.0
    float    progress = (float)elapsed / duration;
    uint32_t expBrightness;
    uint8_t  exponentMultiplier = 3; // Multiplier to adjust the steepness of the curve

    if (isFadingIn)
    {
        // Exponential growth formula for fading in
        expBrightness = (exp(progress * exponentMultiplier) - 1) / (exp(exponentMultiplier) - 1) * maxDutyCycle;
    }
    else
    {
        // Exponential decay formula for fading out
        expBrightness = (exp((1 - progress) * exponentMultiplier) - 1) / (exp(exponentMultiplier) - 1) * maxDutyCycle;
    }

    return expBrightness;
}

#endif

#if USE_LED_ANIMATION_SINE
#include <math.h> // Required for exp() function
static uint32_t GetFadeBrightnessSine(uint32_t elapsed, uint32_t duration, uint32_t maxDutyCycle, bool isFadingIn)
{
    // Normalize progress ranging from 0.0 to 1.0
    float progress = (float)elapsed / duration;

    uint32_t brightness;
    uint8_t  exponentMultiplier = 3;

    if (isFadingIn)
    {
        // Rise phase: using the sine function for a smooth increase
        float sineInput = sin(progress * PI / 2); // Sine wave from 0 to PI/2 (0 to 1)
        brightness      = (exp(sineInput * exponentMultiplier) - 1) / (exp(exponentMultiplier) - 1) * maxDutyCycle;
    }
    else
    {
        // Fall phase: inverse of the rise phase
        float sineInput = sin((1 - progress) * PI / 2); // Sine wave from PI/2 to 0 (1 to 0)
        brightness      = (exp(sineInput * exponentMultiplier) - 1) / (exp(exponentMultiplier) - 1) * maxDutyCycle;
    }

    return brightness;
}
#endif

////////////////////////////////////////////////////////

#if USE_LED_ANIMATION_SINE_APPROX
#include <stdint.h>

#define PI 3.14159
#define PI_HALF (PI / 2)
#define EXP_MULTIPLIER 3

// Approximate sine function using a polynomial approximation for sine in the range [0, PI/2]
// sin(x) ≈ x - (x^3 / 6) + (x^5 / 120)
static inline float fast_sine(float x)
{
    float x2 = x * x;
    float x3 = x2 * x;
    float x5 = x3 * x2;
    return x - (x3 / 6) + (x5 / 120);
}

// Precomputed exponential value for EXP_MULTIPLIER
// approximately exp(3) - 1
float EXP_MULTIPLIER_FACTOR = 19.0855f;

static inline float fast_exp(float x)
{
    // Use a polynomial approximation for exponential function
    return 1 + x + (x * x / 2) + (x * x * x / 6);
}

static void update_exp_multiplier_factor()
{
    float maxExpInput     = fast_exp(fast_sine(PI_HALF) * EXP_MULTIPLIER);
    EXP_MULTIPLIER_FACTOR = maxExpInput - 1;

    LED_CONTROL_DBG_MSG("Factor: %ld\r\n", (long)(EXP_MULTIPLIER_FACTOR * 1000));
}

static uint32_t GetFadeBrightnessSineAprox(uint32_t elapsed, uint32_t duration, uint32_t maxDutyCycle, bool isFadingIn)
{
    // Normalize progress ranging from 0.0 to 1.0
    float progress = (float)elapsed / duration;

    float sineInput;
    if (isFadingIn)
    {
        // Rise phase
        sineInput = fast_sine(progress * PI_HALF); // Approx. sine wave from 0 to PI/2 (0 to 1)
    }
    else
    {
        // Fall phase
        sineInput = fast_sine((1 - progress) * PI_HALF); // Approx. sine wave from PI/2 to 0 (1 to 0)
    }

    float    expInput   = fast_exp(sineInput * EXP_MULTIPLIER);
    uint32_t brightness = (uint32_t)((expInput - 1) / EXP_MULTIPLIER_FACTOR * maxDutyCycle);

    // Ensure that brightness does not exceed maxDutyCycle
    if (brightness > maxDutyCycle)
    {
        brightness = maxDutyCycle;
    }

    return brightness;
}
#endif

static uint32_t GetBreathBrightness(uint32_t timeInCycle, LED_Animation_Breath_t* Breath, uint32_t maxDutyCycle)
{
    // Calculate the total duration of one full breath cycle in milliseconds.
    uint32_t totalCycleTimeMs = Breath->riseTimeMs + Breath->fallTimeMs;

    // Get the duration of the rising phase of the breath cycle from the animation parameters.
    uint32_t riseTimeMs = Breath->riseTimeMs;

