bdcabreran/STM32-LED-Animation-PWM/Core/Src/led_animation.c
    uint32_t Brightness;

    // Determine the current phase of the cycle (rising or falling) and calculate brightness
    // accordingly.
    if (timeInCycle < riseTimeMs)
    {
        bool fadeDir = Breath->invert ? false : true;
        Brightness   = CalculateFadeBrightness(timeInCycle, riseTimeMs, maxDutyCycle, fadeDir);
    }
    else
    {
        bool fadeDir = Breath->invert ? true : false;
        Brightness   = CalculateFadeBrightness(timeInCycle - riseTimeMs, Breath->fallTimeMs, maxDutyCycle, fadeDir);
    }

    return Brightness;
}

static LED_Status_t LED_AnimationBreathExecute(LED_Handle_t* this, uint32_t tick)
{
    if (this == NULL || this->animationData == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    if (!this->isRunning)
    {
        return LED_SUCCESS;
    }

    LED_Animation_Breath_t* Breath = (LED_Animation_Breath_t*)this->animationData;

    if (this->startTime == 0)
    {
        this->startTime   = tick;
        this->repeatTimes = Breath->repeatTimes;
        this->controller->Start();
    }

    uint32_t elapsedTime      = tick - this->startTime;
    uint32_t totalCycleTimeMs = Breath->riseTimeMs + Breath->fallTimeMs;
    uint32_t timeInCycle      = elapsedTime % totalCycleTimeMs;

    uint32_t colorCount = CalculateColorCount(this->controller->LedType);
    uint16_t dutyCycleValues[colorCount];

    // Calculate the maximum duty cycle based on the maximum brightness level of  the LED.

    for (uint32_t i = 0; i < colorCount; i++)
    {
        uint32_t maxDutyCycle =
            BRIGHTNESS_TO_DUTY_CYCLE(((uint8_t*)(Breath->color))[i], this->controller->MaxDutyCycle);

        dutyCycleValues[i] = GetBreathBrightness(timeInCycle, Breath, maxDutyCycle);

#if PRINT_COORDINATES
        static uint32_t lastElapsedTime = 0;
        if (lastElapsedTime != timeInCycle && i == 0)
        {
            lastElapsedTime = timeInCycle;
            LED_CONTROL_DBG_MSG("%d; %d\r\n", timeInCycle, dutyCycleValues[i]);
        }
#endif
    }

    LED_Status_t result = ExecuteDutyCycleSetting(this, dutyCycleValues);
    if (result != LED_SUCCESS)
    {
        return result;
    }

    if (elapsedTime >= totalCycleTimeMs)
    {
        this->startTime       = tick;
        bool StopOnCompletion = Breath->invert ? false : true;
        HandleRepeatLogic(this, Breath->repeatTimes, StopOnCompletion);
    }

    return LED_SUCCESS;
}

LED_Status_t LED_Animation_SetFadeIn(LED_Handle_t* this, LED_Animation_FadeIn_t* FadeIn)
{
    if (this == NULL || FadeIn == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_FADE_IN;
    this->animationData = FadeIn;
    this->isRunning     = false;
    LED_CONTROL_DBG_MSG("LED Animation FadeIn\r\n");

    return LED_SUCCESS;
}

static LED_Status_t LED_AnimationFadeInExecute(LED_Handle_t* this, uint32_t tick)
{
    if (this == NULL || this->animationData == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }
    if (!this->isRunning)
    {
        return LED_SUCCESS;
    }

    LED_Animation_FadeIn_t* FadeIn = (LED_Animation_FadeIn_t*)this->animationData;

    if (this->startTime == 0)
    {
        this->startTime   = tick;
        this->repeatTimes = FadeIn->repeatTimes;
        LED_CONTROL_DBG_MSG("Repeat times: %d\r\n", FadeIn->repeatTimes);
        this->controller->Start();
    }

    uint32_t elapsedTime = tick - this->startTime;

    uint32_t colorCount = CalculateColorCount(this->controller->LedType);
    uint16_t dutyCycleValues[colorCount];
    for (uint32_t i = 0; i < colorCount; i++)
    {
        // Calculate the maximum duty cycle based on the maximum brightness level of the LED.
        uint32_t maxDutyCycle =
            BRIGHTNESS_TO_DUTY_CYCLE(((uint8_t*)(FadeIn->color))[i], this->controller->MaxDutyCycle);
        uint32_t start_cycles, end_cycles, total_cycles;

        dutyCycleValues[i] = CalculateFadeBrightness(elapsedTime, FadeIn->durationMs, maxDutyCycle, true);

#if PRINT_COORDINATES
        static uint32_t lastElapsedTime = 0;
        if (lastElapsedTime != elapsedTime && i == 0)
        {
            lastElapsedTime = elapsedTime;
            LED_CONTROL_DBG_MSG("%d; %d\r\n", elapsedTime, dutyCycleValues[i]);
        }
#endif
    }

    LED_Status_t result = ExecuteDutyCycleSetting(this, dutyCycleValues);
    if (result != LED_SUCCESS)
    {
        return result;
    }

    if (elapsedTime >= FadeIn->durationMs)
    {
        HandleRepeatLogic(this, FadeIn->repeatTimes, false);
        this->startTime = tick;
    }

    return LED_SUCCESS;
}

LED_Status_t LED_Animation_SetFadeOut(LED_Handle_t* this, LED_Animation_FadeOut_t* FadeOut)
{
    if (this == NULL || FadeOut == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_FADE_OUT;
    this->animationData = FadeOut;
    this->isRunning     = false;
    LED_CONTROL_DBG_MSG("LED Animation FadeOut\r\n");

    return LED_SUCCESS;
}

static LED_Status_t LED_AnimationFadeOutExecute(LED_Handle_t* this, uint32_t tick)
{
    if (this == NULL || this->animationData == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }
    if (!this->isRunning)
    {
        return LED_SUCCESS;
    }

    LED_Animation_FadeIn_t* FadeOut = (LED_Animation_FadeOut_t*)this->animationData;

    if (this->startTime == 0)
    {
        this->startTime   = tick;
        this->repeatTimes = FadeOut->repeatTimes;
        this->controller->Start();
    }

    uint32_t elapsedTime = tick - this->startTime;

    uint32_t colorCount = CalculateColorCount(this->controller->LedType);

    uint16_t dutyCycleValues[colorCount];
    for (uint32_t i = 0; i < colorCount; i++)
    {
        // Calculate the maximum duty cycle based on the maximum brightness level of the LED.
        uint32_t maxDutyCycle =
            BRIGHTNESS_TO_DUTY_CYCLE(((uint8_t*)(FadeOut->color))[i], this->controller->MaxDutyCycle);
        dutyCycleValues[i] = CalculateFadeBrightness(elapsedTime, FadeOut->durationMs, maxDutyCycle, false);

#if PRINT_COORDINATES
        static uint32_t lastElapsedTime = 0;
        if (lastElapsedTime != elapsedTime && i == 0)
        {
            lastElapsedTime = elapsedTime;
            LED_CONTROL_DBG_MSG("%d; %d\r\n", elapsedTime, dutyCycleValues[i]);
        }
#endif
    }

    LED_Status_t result = ExecuteDutyCycleSetting(this, dutyCycleValues);
    if (result != LED_SUCCESS)
    {
        return result;
    }

