bdcabreran/STM32-LED-Animation-PWM/Core/Src/led_animation.c
    if (elapsedTime >= FadeOut->durationMs)
    {
        HandleRepeatLogic(this, FadeOut->repeatTimes, true);
        this->startTime = tick;
    }

    return LED_SUCCESS;
}

LED_Status_t LED_Animation_SetPulse(LED_Handle_t* this, LED_Animation_Pulse_t* Pulse)
{
    if (this == NULL || Pulse == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_PULSE;
    this->animationData = Pulse;
    this->isRunning     = false;
    LED_CONTROL_DBG_MSG("LED Animation Pulse\r\n");

    return LED_SUCCESS;
}

static uint32_t GetPulseBrightness(uint32_t timeInCycle, LED_Animation_Pulse_t* Pulse, uint32_t maxDutyCycle)
{
    uint32_t riseTimeMs    = Pulse->riseTimeMs;
    uint32_t holdOnTimeMs  = Pulse->holdOnTimeMs;
    uint32_t holdOffTimeMs = Pulse->holdOffTimeMs;
    uint32_t fallTimeMs    = Pulse->fallTimeMs;

    uint32_t Brightness;

    if (timeInCycle < riseTimeMs)
    {
        Brightness = CalculateFadeBrightness(timeInCycle, riseTimeMs, maxDutyCycle, true);
    }
    else if (timeInCycle < (riseTimeMs + holdOnTimeMs))
    {
        Brightness = maxDutyCycle;
    }
    else if (timeInCycle < (riseTimeMs + holdOnTimeMs + fallTimeMs))
    {
        Brightness = CalculateFadeBrightness(timeInCycle - riseTimeMs - holdOnTimeMs, fallTimeMs, maxDutyCycle, false);
    }
    else if (timeInCycle < (riseTimeMs + holdOnTimeMs + fallTimeMs + holdOffTimeMs))
    {
        Brightness = 0;
    }

    return Brightness;
}

static LED_Status_t LED_AnimationPulseExecute(LED_Handle_t* this, uint32_t tick)
{
    if (this == NULL || this->animationData == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    if (!this->isRunning)
    {
        return LED_SUCCESS;
    }

    LED_Animation_Pulse_t* Pulse = (LED_Animation_Pulse_t*)this->animationData;

    if (this->startTime == 0)
    {
        this->startTime   = tick;
        this->repeatTimes = Pulse->repeatTimes;
        this->controller->Start();
    }

    uint32_t riseTimeMs    = Pulse->riseTimeMs;
    uint32_t holdOnTimeMs  = Pulse->holdOnTimeMs;
    uint32_t holdOffTimeMs = Pulse->holdOffTimeMs;
    uint32_t fallTimeMs    = Pulse->fallTimeMs;

    uint32_t elapsedTime      = tick - this->startTime;
    uint32_t totalCycleTimeMs = riseTimeMs + holdOnTimeMs + fallTimeMs + holdOffTimeMs;
    uint32_t timeInCycle      = elapsedTime % totalCycleTimeMs;

    uint32_t colorCount = CalculateColorCount(this->controller->LedType);
    uint16_t dutyCycleValues[colorCount];

    uint32_t start_cycles, end_cycles, total_cycles1, total_cycles2;
    for (uint32_t i = 0; i < colorCount; i++)
    {

        start_cycles          = DWT->CYCCNT;
        uint32_t maxDutyCycle = BRIGHTNESS_TO_DUTY_CYCLE(((uint8_t*)(Pulse->color))[i], this->controller->MaxDutyCycle);
        dutyCycleValues[i]    = GetPulseBrightness(timeInCycle, Pulse, maxDutyCycle);
        end_cycles            = DWT->CYCCNT;
        total_cycles1         = end_cycles - start_cycles;
        LED_CONTROL_DBG_MSG("C = %d\r\n", total_cycles1);

#if PRINT_COORDINATES
        static uint32_t lastElapsedTime = 0;
        if (lastElapsedTime != timeInCycle && i == 0)
        {
            lastElapsedTime = timeInCycle;
            LED_CONTROL_DBG_MSG("%d; %d\r\n", timeInCycle, dutyCycleValues[i]);
        }
#endif
    }

    LED_Status_t result = ExecuteDutyCycleSetting(this, dutyCycleValues);
    if (result != LED_SUCCESS)
    {
        return result;
    }

    // end_cycles = DWT->CYCCNT;

    // total_cycles1 = end_cycles - start_cycles;
    // LED_CONTROL_DBG_MSG("Cycles1 = %d\r\n", total_cycles1);

    // LED_CONTROL_DBG_MSG("Cycles2 = %d\r\n", total_cycles1 + total_cycles2);

    if (elapsedTime >= totalCycleTimeMs)
    {
        this->startTime = tick;
        HandleRepeatLogic(this, Pulse->repeatTimes, false);
    }

    return LED_SUCCESS;
}

LED_Status_t LED_Animation_SetAlternatingColors(LED_Handle_t* this,
                                                LED_Animation_AlternatingColors_t* AlternatingColors)
{
    if (this == NULL || AlternatingColors == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_ALTERNATING_COLORS;
    this->animationData = AlternatingColors;
    this->isRunning     = false;
    LED_CONTROL_DBG_MSG("LED Animation Alternating Colors\r\n");

    return LED_SUCCESS;
}

static LED_Status_t LED_AnimationAlternatingColorsExecute(LED_Handle_t* this, uint32_t tick)
{
    // Check for null pointers
    if (this == NULL || this->animationData == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    // If the animation is not running, return success
    if (!this->isRunning)
    {
        return LED_SUCCESS;
    }

    // Cast animation data to the appropriate type
    LED_Animation_AlternatingColors_t* AlternatingColors = (LED_Animation_AlternatingColors_t*)this->animationData;

    // Initialize the start time and start the controller if the animation is starting
    if (this->startTime == 0)
    {
        this->startTime   = tick;
        this->repeatTimes = AlternatingColors->repeatTimes;
        this->controller->Start();
    }

    // Calculate the elapsed time since the animation started
    uint32_t elapsedTime = tick - this->startTime;

    // Calculate the total time for one full cycle of all colors
    uint32_t cycleTimeMs = AlternatingColors->durationMs * AlternatingColors->colorCount;

    // Calculate the number of full cycles completed and the time within the current cycle
    uint32_t timeInCurrentCycle = elapsedTime % cycleTimeMs;

    // Determine the current color index based on the elapsed time within the current cycle
    uint32_t colorIndex = timeInCurrentCycle / AlternatingColors->durationMs;

    // Get the current color
    uint8_t* currentColor = ((uint8_t**)AlternatingColors->colors)[colorIndex];

    // Set the LED color
    LED_Status_t result = ExecuteColorSetting(this, currentColor);
    if (result != LED_SUCCESS)
    {
        return result;
    }

