bdcabreran/STM32-LED-Animation-PWM/Core/Src/led_animation.c
    // Check if the animation should stop after the specified number of repeats
    if (AlternatingColors->repeatTimes != -1 && elapsedTime >= cycleTimeMs * AlternatingColors->repeatTimes)
    {
        this->isRunning = false;
        this->controller->Stop();
        if (this->callback != NULL)
        {
            this->callback(this->animationType, LED_SUCCESS);
        }
    }

    return LED_SUCCESS;
}

LED_Status_t LED_Animation_SetColorCycle(LED_Handle_t* this, LED_Animation_ColorCycle_t* ColorCycle)
{
    if (this == NULL || ColorCycle == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    this->animationType = LED_ANIMATION_COLOR_CYCLE;
    this->animationData = ColorCycle;
    this->isRunning     = false;
    LED_CONTROL_DBG_MSG("LED Animation Color Cycle\r\n");

    return LED_SUCCESS;
}

static LED_Status_t LED_AnimationColorCycleExecute(LED_Handle_t* this, uint32_t tick)
{
    // Validate input pointers
    if (this == NULL || this->animationData == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    // Return success if animation is not running
    if (!this->isRunning)
    {
        return LED_SUCCESS;
    }

    LED_Animation_ColorCycle_t* ColorCycle = (LED_Animation_ColorCycle_t*)this->animationData;

    // Initialize the animation
    if (this->startTime == 0)
    {
        this->startTime   = tick;
        this->repeatTimes = ColorCycle->repeatTimes;
        this->controller->Start();
    }

    uint32_t elapsedTime = tick - this->startTime;
    uint32_t cycleTimeMs = ColorCycle->transitionMs + ColorCycle->holdTimeMs;

    // Calculate the total cycle time
    uint32_t totalCycleTimeMs = (this->repeatTimes == -1 || this->repeatTimes > 1)
                                    ? cycleTimeMs * ColorCycle->colorCount
                                    : cycleTimeMs * ColorCycle->colorCount - ColorCycle->transitionMs;

    uint32_t timeInCycle    = elapsedTime % cycleTimeMs;
    uint32_t colorIndex     = (elapsedTime / cycleTimeMs) % ColorCycle->colorCount;
    uint32_t nextColorIndex = (colorIndex + 1) % ColorCycle->colorCount;

    uint8_t* currentColor = ((uint8_t**)ColorCycle->colors)[colorIndex];
    uint8_t* nextColor    = ((uint8_t**)ColorCycle->colors)[nextColorIndex];

    // Hold phase
    if (timeInCycle < ColorCycle->holdTimeMs)
    {
        LED_Status_t result = ExecuteColorSetting(this, currentColor);
        if (result != LED_SUCCESS)
        {
            return result;
        }
    }
    // Transition phase
    else
    {
        float   fraction             = (timeInCycle - ColorCycle->holdTimeMs) / (float)ColorCycle->transitionMs;
        uint8_t r                    = currentColor[0] + fraction * (nextColor[0] - currentColor[0]);
        uint8_t g                    = currentColor[1] + fraction * (nextColor[1] - currentColor[1]);
        uint8_t b                    = currentColor[2] + fraction * (nextColor[2] - currentColor[2]);
        uint8_t interpolatedColor[3] = {r, g, b};

        LED_Status_t result = ExecuteColorSetting(this, interpolatedColor);
        if (result != LED_SUCCESS)
        {
            return result;
        }
    }

    // Handle animation completion and repetition
    if (elapsedTime >= totalCycleTimeMs)
    {
        this->startTime       = tick;
        bool StopOnCompletion = ColorCycle->leaveLastColor ? true : false;
        HandleRepeatLogic(this, ColorCycle->repeatTimes, StopOnCompletion);
    }

    return LED_SUCCESS;
}

LED_Status_t LED_Animation_SetAnimation(LED_Handle_t* this, void* animationData, LED_Animation_Type_t animationType)
{
    if (this == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    this->animationType = animationType;
    this->animationData = animationData;
    this->isRunning     = false;

    LED_CONTROL_DBG_MSG("LED Animation Set %d\r\n", animationType);

    return LED_SUCCESS;
}

LED_Status_t LED_Animation_GetColor(LED_Handle_t* this, uint8_t* color, uint8_t* colorCount)
{
    if (this == NULL || color == NULL || colorCount == NULL)
    {
        return LED_ERROR_NULL_POINTER;
    }

    *colorCount = CalculateColorCount(this->controller->LedType);

    for (uint32_t i = 0; i < *colorCount; i++)
    {
        color[i] = this->currentColor[i];
    }

    return LED_SUCCESS;
}

// How to Measure Machine Cycle Count
/**
#if MEASURE_CYCLES
start_cycles             = DWT->CYCCNT;
function_to_measure();
end_cycles               = DWT->CYCCNT;
// Calculate the total cycles used
total_cycles = end_cycles - start_cycles;
LED_CONTROL_DBG_MSG("Function consumed %lu cycles\r\n", total_cycles);
#else

**/
